from func import is_unstable

if __name__ == "__main__":
    # Предпочтения кошек
    cats_prefs = {'Сфинкс': ['Мопс', 'Такса', 'Доберман'],
             'Мейн-кун': ['Такса', 'Мопс', 'Доберман'],
             'Девон-рекс': ['Мопс', 'Такса', 'Доберман']}

    # Предпочтения собак
    dogs_prefs = {'Мопс': ['Мейн-кун', 'Сфинкс', 'Девон-рекс'],
                'Такса': ['Сфинкс', 'Мейн-кун', 'Девон-рекс'],
                'Доберман': ['Сфинкс', 'Мейн-кун', 'Девон-рекс']}

    # Данные пары
    cat_dog_pairs = {"Сфинкс":   "Доберман",
                    "Мейн-кун": "Такса",
                    "Девон-рекс":   "Мопс"}

    # Проверяемы пары
    pairs_checked = {'Сфинкс':'Такса', 'Девон-рекс':'Доберман'}

    print('Вывод:')
    is_unstable(cats_prefs, dogs_prefs, cat_dog_pairs, pairs_checked)